In [5]:
#Dependencies
import json
import pprint
import requests
import pandas as pd

In [9]:
tor_df = pd.read_csv("../Data/tor_data.csv")
van_df = pd.read_csv("../Data/van_data.csv")

In [40]:
sum_tor_df = tor_df.groupby(["Price(1-5)"]).sum()
sum_tor_df

            Rating  Number of Reviews      Latitude     Longitude
Price(1-5)
0           1656.0               8046  17117.383263 -31124.375006
1            405.5              13505   4235.210158  -7701.582447
2           1622.5              75939  17684.323645 -32157.016888
3            315.5              17222   3493.051372  -6351.768919
4            107.0               6440   1135.269058  -2064.286059

In [41]:
mean_tor_df = tor_df.groupby(["Price(1-5)"]).mean()
mean_tor_df

              Rating  Number of Reviews   Latitude  Longitude
Price(1-5)
0           4.224490          20.525510  43.666794 -79.398916
1           4.180412         139.226804  43.661960 -79.397757
2           4.006173         187.503704  43.664997 -79.400042
3           3.943750         215.275000  43.663142 -79.397111
4           4.115385         247.692308  43.664195 -79.395618

In [43]:
top_tor_df = tor_df[(tor_df["Price(1-5)"]==4)]
top_tor_df.sort_values(by=["Rating","Number of Reviews"],ascending = False)

,Restaurant Name,Address,Category,Rating,Number of Reviews,Price($),Price(1-5),Latitude,Longitude
12,Byblos,11 Duncan Street,Mediterranean,4.5,890,$$$$,4,43.647546,-79.388123
245,Jacobs & Co. Steakhouse,12 Brant Street,Steakhouses,4.5,603,$$$$,4,43.645399,-79.398028
103,Yasu,81 Harbord Street,Japanese,4.5,416,$$$$,4,43.662690,-79.403140
160,Scaramouche Restaurant Pasta Bar & Grill,1 Benvenuto Place,French,4.5,329,$$$$,4,43.681550,-79.399910
94,Alo Restaurant,163 Spadina Avenue,Bars,4.5,326,$$$$,4,43.648510,-79.395840
376,George Restaurant,111 Queen Street E,Canadian (New),4.5,292,$$$$,4,43.653373,-79.374329
173,Tachi,111 Richmond Street W,Sushi Bars,4.5,175,$$$$,4,43.650291,-79.383952
309,La Banane,227 Ossington Avenue,French,4.5,151,$$$$,4,43.649040,-79.420300
496,Yukashi Japanese Cuisine,643A Mount Pleasant Road,Japanese,4.5,41,$$$$,4,43.704950,-79.388500
223,Kaiseki Yu-zen Hashimoto,6 Garamond Court,Japanese,4.5,31,$$$$,4,43.725960,-79.334030
246,Don Alfonso 1890,1 Harbour Square,Italian,4.5,31,$$$$,4,43.641351,-79.375898
567,Three Brothers Restaurant,657 The Queensway,Mediterranean,4.5,8,$$$$,4,43.627090,-79.498654
395,Canoe,66 Wellington Street W,Canadian (New),4.0,736,$$$$,4,43.646954,-79.382159
238,Patria,480 King Street W,Spanish,4.0,532,$$$$,4,43.645540,-79.396410
828,Barberian's Steak House,7 Elm Street,Steakhouses,4.0,309,$$$$,4,43.657600,-79.382120
640,Akira Back,80 Blue Jays Way,Japanese,4.0,192,$$$$,4,43.645410,-79.392300
930,TOCA,181 Wellington Street W,Italian,4.0,165,$$$$,4,43.645320,-79.387102
611,Actinolite Restaurant,971 Ossington Avenue,Canadian (New),4.0,85,$$$$,4,43.667885,-79.428091
727,Shoushin,3328 Yonge Street,Japanese,4.0,85,$$$$,4,43.731330,-79.404160
322,Opus Restaurant,37 Prince Arthur Avenue,Wine Bars,4.0,73,$$$$,4,43.669210,-79.397230
534,Edomae Kiyomi,76 Gerrard Street E,Sushi Bars,4.0,25,$$$$,4,43.660120,-79.378130
703,Café Boulud,60 Yorkville Avenue,Cafes,3.5,274,$$$$,4,43.671921,-79.388922
688,One Restaurant,116 Yorkville Avenue,Canadian (New),3.5,226,$$$$,4,43.670880,-79.393230
600,STK Toronto,153 Yorkville Avenue,Steakhouses,3.5,216,$$$$,4,43.670324,-79.394185
597,BlueBlood Steakhouse,1 Austin Terrace,Steakhouses,3.5,155,$$$$,4,43.678110,-79.409480
500,Sofia,99 Yorkville Ave,Italian,3.0,74,$$$$,4,43.670704,-79.391838

In [46]:
high_tor_df = tor_df[(tor_df["Price(1-5)"]==3)]
high_tor_df.head()

,Restaurant Name,Address,Category,Rating,Number of Reviews,Price($),Price(1-5),Latitude,Longitude
1,Richmond Station,1 Richmond Street W,Canadian (New),4.5,869,$$$,3,43.651373,-79.379285
6,Aloette,163 Spadina Avenue,French,4.5,279,$$$,3,43.648558,-79.395963
9,Holy Cow Japanese Steakhouse,254 Queen Street W,Steakhouses,4.5,139,$$$,3,43.649930,-79.391450
13,Fieramosca,36A Prince Arthur Avenue,Italian,4.5,110,$$$,3,43.669630,-79.397190
19,Ristorante Sotto Sotto,120 Avenue Road,Italian,4.0,121,$$$,3,43.673740,-79.396460

In [47]:
mid_tor_df = tor_df[(tor_df["Price(1-5)"]==2)]
mid_tor_df.head()

,Restaurant Name,Address,Category,Rating,Number of Reviews,Price($),Price(1-5),Latitude,Longitude
0,Pai Northern Thai Kitchen,18 Duncan Street,Thai,4.5,3335,$$,2,43.647840,-79.388720
2,Mira,420A Wellington Street W,Peruvian,4.5,256,$$,2,43.644170,-79.396390
3,Rasa,196 Robert Street,Canadian (New),4.5,317,$$,2,43.662775,-79.403968
4,KINKA IZAKAYA ORIGINAL,398 Church Street,Japanese,4.0,1790,$$,2,43.660424,-79.378900
5,Katsuya,66 Gerrard Street E,Japanese,4.5,478,$$,2,43.659950,-79.378820

In [48]:
low_tor_df = tor_df[(tor_df["Price(1-5)"]==1)]
low_tor_df.head()

,Restaurant Name,Address,Category,Rating,Number of Reviews,Price($),Price(1-5),Latitude,Longitude
8,Seven Lives Tacos y Mariscos,72 Kensington Avenue,Mexican,4.5,1458,$,1,43.654490,-79.400830
15,Juicy Dumpling,280 Spadina Ave,Dim Sum,4.5,594,$,1,43.652520,-79.398540
35,Manpuku Japanese Eatery,105 McCaul Street,Japanese,4.0,512,$,1,43.654060,-79.391010
57,Okonomi House Restaurant,23 Charles Street W,Japanese,4.0,309,$,1,43.668311,-79.387134
79,El Nahual Tacos,556 parliament st,Mexican,4.5,147,$,1,43.666945,-79.369220